{
  "metadata": {
    "source": "X12 / Washington Publishing Company (WPC) - RARC list",
    "note": "Curated subset of common RARC codes seen in denial remittances. Full list at wpc-edi.com.",
    "last_updated": "2026-02-19",
    "version": "1.1"
  },
  "rarc_codes": {
    "MA01": {
      "description": "If you do not agree with what we approved for these services, you may appeal our decision.",
      "category": "Appeal Rights",
      "action_hint": "Review denial notice for appeal deadlines and required documentation."
    },
    "MA04": {
      "description": "Secondary payment cannot be considered without the identity of or payment information from the primary payer.",
      "category": "Coordination of Benefits",
      "action_hint": "Submit primary payer EOB and payment details."
    },
    "MA07": {
      "description": "The claim information has also been forwarded to Medicaid for review.",
      "category": "Coordination of Benefits",
      "action_hint": "Monitor Medicaid review status before resubmission."
    },
    "MA13": {
      "description": "You may be subject to penalties if you bill the patient for amounts not reported with the PR group code.",
      "category": "Compliance",
      "action_hint": "Ensure patient billing complies with PR group code and payer rules."
    },
    "MA18": {
      "description": "The claim information is also being forwarded to the patient's supplemental insurer.",
      "category": "Coordination of Benefits",
      "action_hint": "Wait for supplemental insurer processing before rebilling."
    },
    "MA130": {
      "description": "Your claim contains incomplete and/or invalid information, and no appeal rights are afforded because the claim is unprocessable.",
      "category": "Claim Processing",
      "action_hint": "Correct missing or invalid claim data and resubmit a new claim."
    },
    "N30": {
      "description": "Patient not eligible for this payer's coverage on the date of service.",
      "category": "Eligibility",
      "action_hint": "Verify patient coverage dates and update insurance information."
    },
    "N56": {
      "description": "Procedure code billed is not correct/valid for the services billed or the date of service billed.",
      "category": "Coding",
      "action_hint": "Verify CPT/HCPCS code accuracy and correct billing date."
    },
    "N95": {
      "description": "This provider type/provider specialty may not bill this service.",
      "category": "Provider Eligibility",
      "action_hint": "Confirm provider specialty billing rules or bill under eligible provider."
    },
    "N115": {
      "description": "This decision was based on a Local Coverage Determination (LCD).",
      "category": "Medical Necessity",
      "action_hint": "Review applicable LCD criteria and submit supporting documentation."
    },
    "N386": {
      "description": "This decision was based on a Local Coverage Determination (LCD). An Advance Beneficiary Notice (ABN) was not on file.",
      "category": "Medical Necessity",
      "action_hint": "Confirm ABN requirements and provide documentation if applicable."
    },
    "N579": {
      "description": "The services are not covered because they are not considered medically reasonable and necessary under the payer's guidelines.",
      "category": "Medical Necessity",
      "action_hint": "Submit clinical documentation supporting medical necessity."
    },
    "N657": {
      "description": "This claim has been identified as a readmission.",
      "category": "Clinical Review",
      "action_hint": "Provide documentation supporting medical necessity of readmission."
    },
    "N362": {
      "description": "The number of days or units of service exceeds our acceptable maximum.",
      "category": "Benefit Limits",
      "action_hint": "Verify benefit limits and provide medical justification for excess units."
    },
    "N432": {
      "description": "Adjustment based on the contractual agreement between payer and provider.",
      "category": "Contractual Adjustment",
      "action_hint": "Review payer contract terms to verify allowable amounts."
    },
    "N519": {
      "description": "Invalid or missing modifier(s).",
      "category": "Coding",
      "action_hint": "Verify required modifiers and resubmit corrected claim."
    },
    "N522": {
      "description": "Duplicate of a claim processed, or to be processed, as a crossover claim.",
      "category": "Duplicate Claim",
      "action_hint": "Verify claim status before resubmitting to avoid duplicate billing."
    },
    "N650": {
      "description": "This is a payer-initiated adjustment to ensure correct payment.",
      "category": "Adjustment",
      "action_hint": "Review payment adjustment details on the ERA/EOB."
    }
  }
}
